config/Catalogs/СложныеОтсрочкиПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СложныеОтсрочкиПлатежа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Поставщики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отсрочка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брэнд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Брэнды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Отсрочка по определенному складу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/СложныеОтсрочкиПлатежа/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	#Если   Клиент Тогда
		
		РезВопр=Вопрос("Изменить название отсрочки на 
		|"+ЭтотОбъект.Отсрочка+" "+ЭтотОбъект.БрЭнд+" "+ЭтотОбъект.Регион+" "+ЭтотОбъект.Склад+"?",режимДиалогаВопрос.ДаНет,0);
		
		Если РезВопр=КодВозвратаДиалога.Да ТОгда
			ЭтотОбъект.Наименование=""+ЭтотОбъект.Отсрочка+" "+ЭтотОбъект.БрЭнд+" "+ЭтотОбъект.Регион+" "+ЭтотОбъект.Склад;
			
			Пока Найти(ЭтотОбъект.Наименование,"  ")<>0 Цикл
				ЭтотОбъект.Наименование=СокрЛП(СтрЗаменить(ЭтотОбъект.Наименование,"  "," "));
			КонецЦикла;
		КонецЕсли;
		
	#Конецесли 			
КонецПроцедуры
